<!-- dflook/terraform-github-actions {"workspace":"opentofu-exclude-support-2","backend_type":"remote","backend":"4fd163ff5eb3fa361d96bb8fea5f54341d6bddac590293e0ce74f21ac707dc2a","plan_job_ref":"Job Test Terraform cloud #341 at https://github.com/dflook/terraform-github-actions/actions/runs/15541952720","plan_hash":"352a1d81195d2fd44918490badf9d792eced1b4391672b5fd2ab0992fb714496","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __opentofu-exclude-support-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #341](https://github.com/dflook/terraform-github-actions/actions/runs/15541952720)